import '../styles/features.css';
import EcommerceImg from '../images & logos/e-commerce.png';
import TrainingImg from '../images & logos/training.png';
import Fb from '../images & logos/fb.png';
import DmImg from '../images & logos/dm.png';
import DevImg from '../images & logos/landing.png';
import DesignImg from '../images & logos/design.png';
import VidEditing from '../images & logos/vid-editing.png';
import InfoGImg from '../images & logos/infog.png';

function Features() {
  return (
    <div id='features' className='features'>
        <div className="title">
            <img src={TrainingImg} alt="" />
            <h1>التدريب</h1>
        </div>

        <div className="container">
            <div className="fb">
                <div>
                    <h1>Facebook ads</h1>
                    <p>في سياق تدريب الوكالات، "إعلانات فيسبوك" تشير إلى الجلسات التعليمية أو ورش العمل التي تقدمها الوكالات لعملائها. تهدف هذه الجلسات إلى تعليم العملاء كيفية إنشاء وإدارة وتحسين حملات الإعلانات على منصة إعلانات فيسبوك. يتعلم العملاء حول خيارات الاستهداف، وتنسيقات الإعلانات، وتحديد الميزانية، واستراتيجيات الضربة الثمنية، وتتبع أداء الإعلانات، وتقنيات تحسين الحملات. يساعد التدريب العملاء على الاستفادة من إعلانات فيسبوك بشكل فعّال لتحقيق أهدافهم التسويقية وزيادة عائد الاستثمار (ROI) من جهود الإعلانات الخاصة بهم.</p>
                </div>

                <img src={Fb} alt="" />
            </div>

            <div className="e-commerce">
                <img src={EcommerceImg} alt="" />

                <div>
                    <h1>E-commerce</h1>
                    <p>تشير إلى عمليات الشراء والبيع التي تتم عبر الإنترنت. في سياق التدريب في الوكالات، قد يتضمن ذلك توجيه العملاء حول كيفية إدارة وتحسين المتاجر الإلكترونية الخاصة بهم، وتنفيذ استراتيجيات التسويق عبر الإنترنت لزيادة المبيعات وتحسين تجربة التسوق عبر الإنترنت</p>
                </div>
            </div>

            <div className="digital-marketing">
                <div>
                    <h1>Digital Marketing</h1>
                    <p>التسويق الرقمي يشير إلى استخدام الوسائط الرقمية والمنصات عبر الإنترنت لتسويق المنتجات والخدمات وبناء العلاقات مع العملاء. في سياق تدريب الوكالات، يتضمن التسويق الرقمي تعليم الموظفين والعملاء حول استراتيجيات التسويق عبر الإنترنت مثل تحسين محركات البحث (SEO)، والإعلان على الشبكات الاجتماعية، والبريد الإلكتروني، والمحتوى، وغيرها. يهدف التدريب إلى تمكين المشاركين من فهم كيفية استخدام الأدوات والتقنيات الرقمية للوصول إلى الجمهور المستهدف، وتحسين التفاعل معه، وتحقيق الأهداف التسويقية بكفاءة.</p>
                </div>

                <img src={DmImg} alt="" />
            </div>

            <div className="development">
                <img src={DevImg} alt="" />

                <div>
                    <h1>Development app/web</h1>
                    <p>تطوير التطبيقات أو المواقع الإلكترونية يتضمن عملية برمجة وتصميم تطبيقات جديدة أو مواقع على الإنترنت. في سياق تدريب الوكالات، يشمل ذلك تعليم الموظفين والعملاء حول كيفية تطوير وبناء التطبيقات والمواقع باستخدام لغات البرمجة المناسبة والأدوات التقنية. يتضمن التدريب أيضًا تصميم واجهات المستخدم، وإدارة قواعد البيانات، وتحسين تجربة المستخدم، وضمان الأمان والأداء الجيد للتطبيقات أو المواقع.</p>
                </div>
            </div>

            <div className="design">
                <div>
                    <h1>Design</h1>
                    <p>التصميم في سياق التدريب في الوكالات يشمل عملية إنشاء وتطوير العناصر البصرية التي تشمل الجرافيك وتصميم الويب وتجربة المستخدم والتصميم الإبداعي. يشمل ذلك تعلم تقنيات التصميم المختلفة مثل استخدام برامج التصميم الجرافيكي مثل Photoshop وIllustrator، وفهم مبادئ تصميم الويب وتجربة المستخدم، وتطوير مهارات الإبداع والتفكير الابتكاري. يهدف التدريب إلى تمكين المشاركين من إنتاج مواد تصميمية جذابة وفعالة لمشاريع العملاء وتعزيز العلامة التجارية وتحقيق الأهداف التسويقية.</p>
                </div>

                <img src={DesignImg} alt="" />
            </div>

            <div className="vid-editing">
                <img src={VidEditing} alt="" />

                <div>
                    <h1>Video Editing</h1>
                    <p>تحرير الفيديو هو عملية تعديل وتنسيق مقاطع الفيديو لإنشاء محتوى منسق وجذاب. في سياق التدريب في الوكالات، يتعلم المشاركون كيفية استخدام برامج تحرير الفيديو مثل Adobe Premiere Pro أو Final Cut Pro لقص وترتيب المشاهد، وإضافة تأثيرات بصرية وصوتية، وتعديل الإضاءة والألوان، وتحسين جودة الصورة والصوت. يهدف التدريب إلى تمكين المشاركين من إنشاء مقاطع فيديو احترافية وجذابة لمشاريع العملاء، سواء كان ذلك للإعلانات، أو الحملات التسويقية، أو المحتوى التوعوي.</p>
                </div>
            </div>

            <div className="infographic">
                <div>
                    <h1>Infographic</h1>
                    <p>الإنفوجرافيك هو تقنية تصميمية تستخدم لتمثيل البيانات والمعلومات بشكل بصري وجذاب. يهدف الإنفوجرافيك إلى تسهيل فهم المعلومات المعقدة من خلال استخدام الرسومات والرموز والنصوص التوضيحية بطريقة بسيطة ومرئية. في سياق التدريب في الوكالات، يتعلم المشاركون كيفية إنشاء إنفوجرافيكس مبتكرة وجذابة باستخدام برامج التصميم المختلفة مثل Adobe Illustrator أو Canva. يتضمن ذلك تحليل البيانات وترتيبها بشكل منطقي، وتصميم الرسومات والعناصر البصرية، وتنسيق النصوص لتوفير تجربة مرئية مميزة للمستخدمين وتحقيق الأهداف التوضيحية والتسويقية للعميل.</p>
                </div>

                <img src={InfoGImg} alt="" />
            </div>
        </div>
    </div>
  )
}

export default Features